#+TITLE: FFT (Fast Fourier Transform) 笔记
#+DATE: <2019-01-03>
#+CATEGORIES: 专业笔记
#+TAGS: Fourier, 数学, Python
#+HTML: <!-- toc -->
#+HTML: <!-- more -->
* 简的可以手算的例子

我之所以会对这个感兴趣, 是因为我想要用电脑对一些函数做 Fourier Transform ,于是得知有 FFT 这样现成的程序. 但是 FFT 给出的结果
却令我难过. 因为我不知道它给出的是些什么. 一堆复数, 画出来形状也很奇怪. 不知道输出的结果对应的横坐标.

既然这样, 只要知道了 FFT 的原理, 就一定能够得出我想要的答案. 答案就是它的输出, 是上式等号左边那一个列向量的数值然后把 $\frac{T}{N}$
除掉, 也就是 $F(m\Delta\omega)\frac{N}{T}$

参考书上的例子, 拿一个 $N = 4$ 的例子, 进行手算, 然后与程序给出的结果对比, 便能够验证上面的猜想

 $N = 4$ 的例子:
假设函数 $f(t)$ 离散化之后的四个数值为 $\{1, 1, 0, 0\}$ , 也就是说
\begin{align*}
  f\left(\frac{0T}{4}\right) = 1 \\
  f\left(\frac{T}{4}\right) = 1\\
  f\left(\frac{2T}{4}\right) = 0\\
  f\left(\frac{3T}{4}\right) = 0
\end{align*}
那么
\begin{align*}
  \frac{4}{T}F(0\cdot\Delta\omega) &= 1\cdot f\left(\frac{0T}{4}\right) + 1\cdot f\left(\frac{T}{4}\right) + 1\cdot f\left(\frac{2T}{4}\right) + 1\cdot f\left(\frac{3T}{4}\right) \\
                  &= 1\cdot 1 + 1\cdot 1 +1 \cdot 0 + 1\cdot 0\\
                  &= 2\\
  \frac{4}{T}F(1\cdot\Delta\omega) &= 1\cdot f\left(\frac{0T}{4}\right) + e^{-\mathrm{i}\frac{2\pi}{4}}\cdot f\left(\frac{T}{4}\right)
                + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 2}\cdot f\left(\frac{2T}{4}\right) + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 3}\cdot f\left(\frac{3T}{4}\right) \\
                  & =   1\cdot 1 + (-\mathrm{i})\cdot 1 +(-1) \cdot 0 + (\mathrm{i})\cdot 0\\
                  &= 1 - \mathrm{i}\\
  \frac{4}{T}F(2\cdot\Delta\omega) &= 1\cdot f\left(\frac{0T}{4}\right) + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 2}\cdot f\left(\frac{T}{4}\right)
                + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 2\times 2}\cdot f\left(\frac{2T}{4}\right) + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 2\times 3}\cdot f\left(\frac{3T}{4}\right) \\
                  & =   1\cdot 1 + (-1)\cdot 1 +1 \cdot 0 + (-1)\cdot 0\\
                  &= 0\\
  \frac{4}{T}F(3\cdot\Delta\omega) &= 1\cdot f\left(\frac{0T}{4}\right) + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 3}\cdot f\left(\frac{T}{4}\right)
                + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 3\times 2}\cdot f\left(\frac{2T}{4}\right) + e^{-\mathrm{i}\frac{2\pi}{4}\cdot 3\times 3}\cdot f\left(\frac{3T}{4}\right)\\
                  & =   1\cdot 1 + (\mathrm{i})\cdot 1 +( - 1) \cdot 0 + (-\mathrm{i})\cdot 0\\
                  &= 1 + \mathrm{i}
\end{align*}
也就是
\begin{align*}
  \left(
    \begin{array}{c}
       2 \\
       1-i \\
       0 \\
       1+i
    \end{array}
  \right)
  =
  \left(
  \begin{array}{cccc}
    1&1&1&1 \\
    1&-\mathrm{i}&-1&\mathrm{i}\\
    1&-1&1&-1 \\
    1&\mathrm{i}&-1&-\mathrm{i}
  \end{array}
    \right)
  \left(
    \begin{array}{c}
       1 \\
       1 \\
       0 \\
       0
    \end{array}
  \right)\end{align*}
然后用 Numpy 中的 numpy.fft.fft() 函数计算
#+BEGIN_SRC python :results output
import numpy as np
f = ([1,1,0,0])
F = np.fft.fft(f)
print(F)
#+END_SRC

#+RESULTS:
: [2.+0.j 1.-1.j 0.+0.j 1.+1.j]

输出结果为
#+BEGIN_SRC python
: [2.+0.j 1.-1.j 0.+0.j 1.+1.j]
#+END_SRC
验证了前面对于 FFT 的原理理解.

